# IFCExtrusionCreationData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCExtrusionCreationData Methods
IFCExtrusionCreationData Class See Also
---
The IFCExtrusionCreationData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddOpening | Adds an opening to the data. |
| ClearOpenings | Removes all cached openings from the data. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLocalPlacement | Gets the reference to the IfcLocalPlacement handle used when creating the extrusion. |
| GetOpenings | Gets a collection of all of the openings stored in this data. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetLocalPlacement | Sets the data to reference an IfcLocalPlacement handle when creating the extrusion. Side effect: will set ReuseLocalPlacement to true. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace